/*
***************************************Copyright (c)***************************
**                               	  武汉钛联信息技术有限公司
**                                     		工程事业部
**                                        
**
**                                		 
**
**--------------文件信息-------------------------------------------------------
**文   件   名: Flash.c
**创   建   人: 杨开琦
**最后修改日期: 2018年6月4日
**描        述: 内部Flash操作
**              
**--------------历史版本信息---------------------------------------------------
** 创建人: 杨开琦
** 版  本: v1.0
** 日　期: 2018年6月4日
** 描　述: 初始创建
**
**--------------当前版本修订---------------------------------------------------
** 修改人: 
** 日　期: 
** 描　述: 
**
**-----------------------------------------------------------------------------
******************************************************************************/
#include "flash.h"
#include "common.h"

/******************************************************************************
** 函数名称: _flash_Erase_Page
** 功能描述: 擦除指定区间的Flash；此函数没有Unlock Flash，必须在Unlock Flash之后调用
** 入口参数: 要擦除的区间地址与长度
** 返 回 值: 无
**
** 作　者: 杨开琦
** 日　期: 2018年6月4日
**-----------------------------------------------------------------------------
******************************************************************************/
void _flash_Erase_Pages(uint32_t address, uint16_t length) {
  uint32_t EraseCounter = 0x0;
  uint32_t NbrOfPage = FLASH_PagesMask(length);
  FLASH_Status FLASHStatus = FLASH_COMPLETE;
  /* Erase the FLASH pages */
  for (EraseCounter = 0; (EraseCounter < NbrOfPage) && (FLASHStatus == FLASH_COMPLETE); EraseCounter++)
  {
    FLASHStatus = FLASH_ErasePage(address + (PAGE_SIZE * EraseCounter));
  }
}

/******************************************************************************
** 函数名称: flash_write
** 功能描述: 将数据写入flash
** 入口参数: 要写入的起始地址；要写入的数据头指针；要写入的数据长度(字节数)
** 返 回 值: 写入结果：0--失败；1--成功
**
** 作　者: 杨开琦
** 日　期: 2018年6月4日
**-----------------------------------------------------------------------------
******************************************************************************/
uint8_t flash_write(uint32_t address, uint8_t *pdata, uint16_t length) {
  if(!IS_FLASH_ADDRESS(address) || !IS_FLASH_ADDRESS(address+length)) return 0;
  
  FLASH_Unlock();
  
  _flash_Erase_Pages(address, length);
  uint16_t *pwrite = (uint16_t *)pdata;
  for(uint16_t i = 0; i < length; i+=2) {
    FLASH_ProgramHalfWord(address + i, *pwrite++);
  }
  
  FLASH_Lock();
  return 1;
}

/******************************************************************************
** 函数名称: flash_read
** 功能描述: 读取flash中的数据
** 入口参数: 要读取的起始地址；保存读取出的数据的头指针；要读取的数据长度(字节数)
** 返 回 值: 读取结果：0--失败；1--成功
**
** 作　者: 杨开琦
** 日　期: 2018年6月4日
**-----------------------------------------------------------------------------
******************************************************************************/
uint8_t flash_read(uint32_t address, uint8_t *pdata, uint16_t length) {
  if(!IS_FLASH_ADDRESS(address) || !IS_FLASH_ADDRESS(address+length)) return 0;
  
  for(uint16_t i = 0; i < length; i++) {
    *pdata++ = *(__IO uint8_t *) (address + i);
  }
  return 1;
}
